app/controllers/admin/users_controller.rb

SELECT  "roles".* FROM "roles" ORDER BY "roles"."id" DESC LIMIT $1  [["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."deleted_at" IS NULL ORDER BY "users"."id" ASC LIMIT $1  [["LIMIT", 1]]
SELECT  "roles".* FROM "roles" INNER JOIN "users_roles" ON "roles"."id" = "users_roles"."role_id" WHERE "users_roles"."user_id" = $1 ORDER BY "roles"."id" ASC LIMIT $2  [["user_id", 1], ["LIMIT", 1]]
SELECT COUNT(*) FROM (SELECT DISTINCT "users".* FROM "users" WHERE "users"."deleted_at" IS NULL AND (id != 1) ORDER BY "users"."created_at" DESC) subquery_for_count
---
    def index
      if params[:role]
        return @users = User.all.drop(1) if params[:role].eql?('all')
        @users = User.filter_by_role(@objects, params[:role])
        @rol = params[:role]
        respond_to_formats(@users)
      else
        @users = User.all.drop(1)
        @users = @users.reject{|user| user.roles.empty?}

SELECT  "users".* FROM "users" WHERE "users"."deleted_at" IS NULL AND "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_user
      if params[:id].eql?('clients') || params[:id].eql?('admins')
        redirect_to action: :index, role: params[:id]
      else
        @user = User.find(params[:id])

SELECT COUNT(*) FROM (SELECT  DISTINCT "users".* FROM "users" WHERE "users"."deleted_at" IS NULL AND (id != 1) ORDER BY "users"."created_at" DESC LIMIT $1 OFFSET $2) subquery_for_count  [["LIMIT", 10], ["OFFSET", 0]]
---
    def set_users
      @q = User.ransack(params[:q])
      users = @q.result(distinct: true).where('id != ?', User.first.id)
      users = users.order(created_at: :desc)
      @objects = users.page(@current_page)