app/views/app/layouts/_meta_tags.html.haml

%meta{ name: 'twitter:app:country', content: @country_code }
%meta{ name: "twitter:creator", content: (@post.user.name unless @post.blank?) }
---
SELECT  "users".* FROM "users" WHERE "users"."deleted_at" IS NULL AND "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]