app/views/admin/layouts/_sidebar.html.haml

SELECT  "settings".* FROM "settings" ORDER BY "settings"."id" ASC LIMIT $1  [["LIMIT", 1]]
---
            = link_to '/admin/settings/sheetsu_setting' do
              = t('keppler.sidebar-menu.setting-submenu.load-in-batch')